import {
  Box,
  Chip,
  Container,
  Typography,
  TextareaAutosize,
  Button,
  Select,
  InputLabel,
  FormControl,
} from '@mui/material';
import { FC } from 'react';

export const VisitPage: FC = () => {
  return (
    <Container>
      <Typography variant="h2">Прием</Typography>
      <Typography variant="body1">Иванов Иван</Typography>
      <Typography variant="caption">01.05.2023 8:30</Typography>

      <Box sx={{ marginTop: '2rem', marginBottom: '2rem' }}>
        <Typography variant="body1">
          Медицинские данные заполненные врачем. дублируются в качестве тестовой информации. Медицинские данные
          заполненные врачем. дублируются в качестве тестовой информации. Медицинские данные заполненные врачем.
          дублируются в качестве тестовой информации. Медицинские данные заполненные врачем. дублируются в качестве
          тестовой информации. Медицинские данные заполненные врачем. дублируются в качестве тестовой информации.
          Медицинские данные заполненные врачем. дублируются в качестве тестовой информации. Медицинские данные
          заполненные врачем. дублируются в качестве тестовой информации. Медицинские данные заполненные врачем.
          дублируются в качестве тестовой информации. Медицинские данные заполненные врачем. дублируются в качестве
          тестовой информации. Медицинские данные заполненные врачем. дублируются в качестве тестовой информации.
          Медицинские данные заполненные врачем. дублируются в качестве тестовой информации. Медицинские данные
          заполненные врачем. дублируются в качестве тестовой информации. Медицинские данные заполненные врачем.
          дублируются в качестве тестовой информации. Медицинские данные заполненные врачем. дублируются в качестве
          тестовой информации. Медицинские данные заполненные врачем. дублируются в качестве тестовой информации.
        </Typography>
        <Chip label="Невролгия" />
      </Box>
      <TextareaAutosize minRows={4} style={{ width: '100%' }} />
      <FormControl fullWidth>
        <InputLabel id="add-label">Добавить диагноз</InputLabel>
        <Select labelId="add-label" label="Добавить диагноз" />
      </FormControl>
      <Button>Добавить запись</Button>
    </Container>
  );
};
